In [1]:
print("Hello World")

Hello World

# Performing Preprocessing Step

## 1.Creating over own dataset

In [5]:
import numpy as np

In [6]:
import pandas as pd

In [7]:
df = pd.DataFrame({'country':['india','france','germany','france','germany','india','germany','france','india','france'],\
                   'age':[38,43,30,48,40,35,np.nan,49,50,37],\
                   'salary':[68000,45000,54000,65000,np.nan,58000,53000,79000,88000,77000],\
                   'purchased':['no','yes','no','no','yes','yes','no','yes','no','yes']
})

In [8]:
df

   country   age   salary purchased
0    india  38.0  68000.0        no
1   france  43.0  45000.0       yes
2  germany  30.0  54000.0        no
3   france  48.0  65000.0        no
4  germany  40.0      NaN       yes
5    india  35.0  58000.0       yes
6  germany   NaN  53000.0        no
7   france  49.0  79000.0       yes
8    india  50.0  88000.0        no
9   france  37.0  77000.0       yes

## 2.Missing Value Imputation

In [9]:
df['age'].mean()

np.float64(41.111111111111114)

In [10]:
df['salary'].mean()

np.float64(65222.22222222222)

In [11]:
from sklearn.impute import SimpleImputer

In [12]:
imp_mean = SimpleImputer(missing_values=np.nan, strategy='mean')

In [13]:
df_imputed=pd.DataFrame()

In [14]:
df_imputed['country']=df['country']

In [15]:
df_imputed

   country
0    india
1   france
2  germany
3   france
4  germany
5    india
6  germany
7   france
8    india
9   france

In [16]:
df_imputed['age']=imp_mean.fit_transform(df[['age']])

In [17]:
df['age']

0    38.0
1    43.0
2    30.0
3    48.0
4    40.0
5    35.0
6     NaN
7    49.0
8    50.0
9    37.0
Name: age, dtype: float64

In [18]:
df[['age']]

    age
0  38.0
1  43.0
2  30.0
3  48.0
4  40.0
5  35.0
6   NaN
7  49.0
8  50.0
9  37.0

In [19]:
df_imputed

   country        age
0    india  38.000000
1   france  43.000000
2  germany  30.000000
3   france  48.000000
4  germany  40.000000
5    india  35.000000
6  germany  41.111111
7   france  49.000000
8    india  50.000000
9   france  37.000000

In [20]:
df_imputed['salary']=imp_mean.fit_transform(df[['salary']])

In [21]:
df_imputed['purchased']=df['purchased']

In [22]:
df_imputed

   country        age        salary purchased
0    india  38.000000  68000.000000        no
1   france  43.000000  45000.000000       yes
2  germany  30.000000  54000.000000        no
3   france  48.000000  65000.000000        no
4  germany  40.000000  65222.222222       yes
5    india  35.000000  58000.000000       yes
6  germany  41.111111  53000.000000        no
7   france  49.000000  79000.000000       yes
8    india  50.000000  88000.000000        no
9   france  37.000000  77000.000000       yes

## 3.Performing Lable Encoding

In [23]:
from sklearn.preprocessing import LabelEncoder

In [24]:
enc=LabelEncoder()

In [25]:
df_encoded=pd.DataFrame()

In [26]:
df_encoded['country']=enc.fit_transform(df_imputed['country'])

In [27]:
df_encoded

   country
0        2
1        0
2        1
3        0
4        1
5        2
6        1
7        0
8        2
9        0

In [28]:
df_encoded['age']=df_imputed['age']

In [29]:
df_encoded['salary']=df_imputed['salary']

In [30]:
df_encoded

   country        age        salary
0        2  38.000000  68000.000000
1        0  43.000000  45000.000000
2        1  30.000000  54000.000000
3        0  48.000000  65000.000000
4        1  40.000000  65222.222222
5        2  35.000000  58000.000000
6        1  41.111111  53000.000000
7        0  49.000000  79000.000000
8        2  50.000000  88000.000000
9        0  37.000000  77000.000000

In [31]:
df_encoded['purchased']=enc.fit_transform(df_imputed['purchased'])

In [32]:
df_encoded

   country        age        salary  purchased
0        2  38.000000  68000.000000          0
1        0  43.000000  45000.000000          1
2        1  30.000000  54000.000000          0
3        0  48.000000  65000.000000          0
4        1  40.000000  65222.222222          1
5        2  35.000000  58000.000000          1
6        1  41.111111  53000.000000          0
7        0  49.000000  79000.000000          1
8        2  50.000000  88000.000000          0
9        0  37.000000  77000.000000          1